package com.trl.stream_api;

public class ExampleDoubleStream {
}

/*
-----------------------------------------------------------------------------------------------------------------------
• static DoubleStream of(double... values)
    Возвращает поток данных типа DoubleStream с заданными элементами.

• double[] toArray()
    Возвращает массив, состоящий из элементов исходного потока данных.

• double sum()
• OptionalDouble average()
• OptionalDouble max()
• OptionalDouble min()
• DoubleSummaryStatisties summaryStatistics()
    Возвращают сумму, среднее, максимум, минимуму элементов исходного потока данных или объект, из которого могут быть
    получены эти четыре результата.

• Stream<Double> boxed()
    Возвращает поток объектов-оболочек для элементов исходного потока данных.
-----------------------------------------------------------------------------------------------------------------------
*/
