package com.trl.stream_api;

public class ExampleBaseStream {
}

/*
-----------------------------------------------------------------------------------------------------------------------
• S parallel()
    Возвращает параллельный поток данных с такими же элементами, как и у исходного потока.

• S unordered()
    Возвращает неупорядоченный поток данных с такими же элементами, как и у исходного потока.
-----------------------------------------------------------------------------------------------------------------------
*/
