package com.trl.stream_api;

public class ExampleIntSummaryStatistics {
}

/*
-----------------------------------------------------------------------------------------------------------------------
• long getCount()
    Возвращает подсчет суммированных элементов.

• (int | long | double) getSum ()
• double getAverage()
    Возвращают сумму или среднее суммированных элементов или же нуль, если элементы отсутствуют.

• (int | long | double) getMax ()
• (int | long | double) getMin ()
    Возвращают максимум или минимум суммированных элементов или же значение Integer|Long|Double).(MAX|MIN)_VALUE, если
    элементы отсутствуют.

• long getCount()
• (int| long| double) getSumO
• double getAverage ()
• (int | long | double) getMax ()
• (int | long | double) getMin ()
    Возвращают подсчет, сумму, среднее, максимум и минимум накапливаемых элементов исходного потока данных.
-----------------------------------------------------------------------------------------------------------------------
*/
